In [1]:
import pandas as pd
import numpy as np

In [2]:
sozlukVerisi={"ankara":[10,np.nan,30],"istanbul":[40,50,np.nan],"adana":[np.nan,80,90]}

In [3]:
tablo=pd.DataFrame(sozlukVerisi,[1,2,3])

In [4]:
tablo

   ankara  istanbul  adana
1    10.0      40.0    NaN
2     NaN      50.0   80.0
3    30.0       NaN   90.0

In [6]:
tablo=tablo.fillna(0)

In [7]:
tablo

   ankara  istanbul  adana
1    10.0      40.0    0.0
2     0.0      50.0   80.0
3    30.0       0.0   90.0

In [9]:
grup =tablo.groupby("ankara")

In [10]:
grup

In [12]:
grup.count()

        istanbul  adana
ankara
0.0            1      1
10.0           1      1
30.0           1      1

In [13]:
grup.max()

        istanbul  adana
ankara
0.0         50.0   80.0
10.0        40.0    0.0
30.0         0.0   90.0

In [14]:
grup.min()

        istanbul  adana
ankara
0.0         50.0   80.0
10.0        40.0    0.0
30.0         0.0   90.0

In [15]:
tablo

   ankara  istanbul  adana
1    10.0      40.0    0.0
2     0.0      50.0   80.0
3    30.0       0.0   90.0

In [16]:
tablo1=pd.DataFrame({"ankara":[10,0,30],"muş":[40,60,90]})

In [17]:
tablo1

   ankara  muş
0      10   40
1       0   60
2      30   90

In [18]:
pd.merge(tablo,tablo1,on="ankara")

   ankara  istanbul  adana  muş
0    10.0      40.0    0.0   40
1     0.0      50.0   80.0   60
2    30.0       0.0   90.0   90